In [18]:
import pandas as pd

In [19]:
df = pd.read_csv('dataset_light_2023_09_27.csv')
df.head()

,station_id,nb_velos_dispo,nb_places_dispo,latitude,longitude,record_timestamp
0,1,0,0,50.641926,3.075992,2023-09-27 10:00:42.773000+00:00
1,1,0,0,50.641926,3.075992,2023-09-27 15:19:00.882000+00:00
2,1,0,0,50.641926,3.075992,2023-09-27 20:28:01.143000+00:00
3,1,0,0,50.641926,3.075992,2023-09-27 01:30:10.842000+00:00
4,1,0,0,50.641926,3.075992,2023-09-27 16:08:00.744000+00:00

In [21]:
df['ratio'] = df['nb_velos_dispo'] / (df['nb_velos_dispo'] + df['nb_places_dispo'])

In [22]:
df['time_index'] = df['record_timestamp'].apply(lambda x: pd.to_datetime(x).to_pydatetime().strftime('%H%M'))

In [23]:
df.drop(['record_timestamp'], axis=1, inplace=True)
df.head()

,station_id,nb_velos_dispo,nb_places_dispo,latitude,longitude,ratio,time_index
0,1,0,0,50.641926,3.075992,NaN,1000
1,1,0,0,50.641926,3.075992,NaN,1519
2,1,0,0,50.641926,3.075992,NaN,2028
3,1,0,0,50.641926,3.075992,NaN,0130
4,1,0,0,50.641926,3.075992,NaN,1608

In [24]:
df_back = df.copy()

In [89]:
df = df_back.copy()

In [90]:
# drop rows with missing values
df.dropna(inplace=True)
df.head()

,station_id,nb_velos_dispo,nb_places_dispo,latitude,longitude,ratio,time_index
37,2,31,0,50.632233,3.046134,1.0,0740
38,3,18,0,50.636093,3.050447,1.0,0847
39,3,18,0,50.636093,3.050447,1.0,0841
40,3,18,0,50.636093,3.050447,1.0,0848
41,3,18,0,50.636093,3.050447,1.0,0854

In [91]:
# convert time_index to int
df['time_index'] = df['time_index'].astype(int)
df.head()

,station_id,nb_velos_dispo,nb_places_dispo,latitude,longitude,ratio,time_index
37,2,31,0,50.632233,3.046134,1.0,740
38,3,18,0,50.636093,3.050447,1.0,847
39,3,18,0,50.636093,3.050447,1.0,841
40,3,18,0,50.636093,3.050447,1.0,848
41,3,18,0,50.636093,3.050447,1.0,854

In [95]:
df = df.sort_values(by=['station_id', 'time_index'], ascending=True)
df.head()

,station_id,nb_velos_dispo,nb_places_dispo,latitude,longitude,ratio,time_index
87260,2,0,31,50.632233,3.046134,0.0,0
163721,2,0,31,50.632233,3.046134,0.0,0
54321,2,0,31,50.632233,3.046134,0.0,2
10730,2,0,31,50.632233,3.046134,0.0,3
54326,2,0,31,50.632233,3.046134,0.0,4

In [102]:
df['transaction'] = 0 if df['time_index'].equals(0) else df['nb_velos_dispo'] - df['nb_velos_dispo'].shift(
)
df.head()

,station_id,nb_velos_dispo,nb_places_dispo,latitude,longitude,ratio,time_index,transaction
87260,2,0,31,50.632233,3.046134,0.0,0,NaN
163721,2,0,31,50.632233,3.046134,0.0,0,0.0
54321,2,0,31,50.632233,3.046134,0.0,2,0.0
10730,2,0,31,50.632233,3.046134,0.0,3,0.0
54326,2,0,31,50.632233,3.046134,0.0,4,0.0

In [88]:
# 
df[df['station_id'] == 25].to_csv('dataset_light_2023_09_27.csv', index=False)